<template>
  <div class="PrivacyPolicy-container">
    <h1>隱私權政策</h1>
    <p>為了讓您能夠安心使用本網站的各項服務與資訊，特此向您說明本網站的隱私權保護政策，以保障您的權益，請您詳閱下列內容：</p>
    <h2>一、隱私權保護政策的適用範圍</h2>
    <p>隱私權保護政策內容，包括本網站如何處理在您使用網站服務時收集到的個人識別資料。隱私權保護政策不適用於本網站以外的相關連結網站，也不適用於非本網站所委託或參與管理的人員。</p>
    <h2>二、個人資料的蒐集、處理及利用方式</h2>
    <ul>
      <li>1. 當您造訪本網站或使用本網站所提供之功能服務時，我們將視該服務功能性質，請您提供必要的個人資料，並在該特定目的範圍內處理及利用您的個人資料；非經您書面同意，本網站不會將個人資料用於其他用途。</li>
      <li>2. 於一般瀏覽時，伺服器會自行記錄相關行徑，包括您使用連線設備的IP位址、使用時間、使用的瀏覽器、瀏覽及點選資料記錄等，做為我們增進網站服務的參考依據，此記錄為內部應用，決不對外公佈。</li>
      <li>3. 為提供精確的服務，我們會將收集的問卷調查內容進行統計與分析，分析結果之統計數據或說明文字呈現，除供內部研究外，我們會視需要公佈統計數據及說明文字，但不涉及特定個人之資料。</li>
    </ul>
    <h2>三、資料之保護</h2>
    <p>只由經過授權的人員才能接觸您的個人資料，如因業務需要有必要委託其他單位提供服務時，本網站亦會嚴格要求其遵守保密義務，並且採取必要檢查程序以確定其將確實遵守。</p>
    <h2>四、網站對外的相關連結</h2>
    <p>本網站的網頁提供其他網站的網路連結，您也可經由本網站所提供的連結，點選進入其他網站。但該連結網站不適用本網站的隱私權保護政策，您必須參考該連結網站中的隱私權保護政策。</p>
    <h2>五、隱私權保護政策之修正</h2>
    <p>本網站隱私權保護政策將因應需求隨時進行修正，修正後的條款將刊登於網站上。</p>
  </div>
</template>

<script>
export default {
    name:'PrivacyPolicy',
}
</script>

<style lang="scss" scoped>
    .PrivacyPolicy-container {
      font-size:1.3rem;
      line-height:1.8rem;
      h1 {
        font-weight: 700;
        font-size:2rem;
        text-align: center;
        margin-top:2rem;
        margin-bottom:3rem;
      }
      p, ul {
        margin-bottom:2.5rem;
        li {
          margin-bottom:1.5rem;
        }
      }
      h1 + p {
        text-align: center;
      }
      h2 {
        font-weight: 700;
        font-size:1.7rem;
        margin-bottom:1.8rem;
      }
    }
</style>